[
  {
    "dataset": "CCPE",
    "conv_id": 105,
    "conv_topic_label": "Other / Uncategorized",
    "n_user_turns": 9,
    "n_scored_user_turns": 9,
    "avg_satisfaction": 3.6296296296296293,
    "median_satisfaction": 3.6666666666666665,
    "low_satisfaction_rate": 0.0,
    "snippet": "Bot: What sort of movies do you like?\nUser: I like action movies and movies about superheroes.\nBot: Can you give me an example of a movie you remember liking?\nUser: I like Avengers: Infinity War.\nBot: What did you like about it?\nUser: I like Avengers. It was a fun movie with lot's of actors that I liked. And it was very pretty.\nBot: who's your favorite actor or actress in the avengers?\nUser: I like Josh Brolin. I like Steve I like Chris Hemsworth, and I like Chris Evans.\nUser: I also like Chris Pratt.\nBot: What do you check for when picking a movie?\nUser: I check for reviews to see how many other people have liked the movie. I check for reviews to see how critics like the movie. I check to see if there is a showtime that will fit my needs and my availability. I don't like how expensive they are to see in theaters, and I don't like how there's a lot of them that aren't good, and it's misleading.\nBot: are you planning on watching the new jurassic world movie?\nUser: I am planning on watching the movie, as soon as I can get some friends together to go.\nBot: thank you"
  },
  {
    "dataset": "SGD",
    "conv_id": 422,
    "conv_topic_label": "Topic 3: MISSING_CONTEXT / UNSUPPORTED_INTENT",
    "n_user_turns": 11,
    "n_scored_user_turns": 11,
    "avg_satisfaction": 3.5,
    "median_satisfaction": 3.5,
    "low_satisfaction_rate": 0.36363636363636365,
    "snippet": "User: I want to buy three tickets for the Lights events.\nBot: Do you have a preference for the date of the event?\nUser: I would like for the event to happen on 12th of this month?\nBot: Is there a specific city where I should look for the event?\nUser: I want the event to be happening around Philadelphia.\nBot: Can you please confirm that you want to book 3 tickets for the Lights event in Philadelphia, which will happen on March 12th?\nUser: That's not right. The event I am looking for is Girl In Red.\nBot: Can you once again please confirm that the tickets you want to buy are for Girl in Red in Philadelphia?\nUser: That's not what I want, because I am in need of only 1 ticket.\nBot: Can you confirm that you want to buy 1 ticket for the event Girl In Red?\nUser: That suits me well.\nBot: Your ticket has been booked. Enjoy the time there!\nUser: I appreciate your help. Though now I need help to plan a round trip flight to go there. I will be flying off on Saturday this week from London, UK.\nBot: Do you plan to return on March 12th?"
  },
  {
    "dataset": "CCPE",
    "conv_id": 63,
    "conv_topic_label": "Topic 2: MISSING_CONTEXT / TONE_ISSUE",
    "n_user_turns": 12,
    "n_scored_user_turns": 12,
    "avg_satisfaction": 3.375,
    "median_satisfaction": 3.375,
    "low_satisfaction_rate": 0.08333333333333333,
    "snippet": "Bot: What type of movies do you like?\nUser: I like like Constantine, and I like a lot of Disney movies, too.\nBot: any particular disney movie you like?\nUser: Good question. I like\nUser: I think one of my favorite movies was Moana. It was It was really good.\nBot: what did you like about moana?\nUser: It was just really nice to watch it. I thought it was a really good movie.\nBot: Can you name me a movie you didn't like?\nUser: Movie I didn't like I think the\nUser: The Incredibles 2 wasn't really that good.\nBot: did you think it was overhyped too?\nUser: Yeah, I did actually.\nBot: anything else you didn't like about it?\nUser: I just felt like the story was really bland."
  },
  {
    "dataset": "CCPE",
    "conv_id": 41,
    "conv_topic_label": "Topic 5: MISSING_CONTEXT / TONE_ISSUE",
    "n_user_turns": 9,
    "n_scored_user_turns": 9,
    "avg_satisfaction": 3.3333333333333335,
    "median_satisfaction": 3.3333333333333335,
    "low_satisfaction_rate": 0.2222222222222222,
    "snippet": "Bot: what kind of movies do u generally like watching\nUser: I prefer horror movies myself and also some action movies.\nBot: why do u like horror and action\nUser: I like to be scared and I like be I like to think a lot and I like a good story and a lot of those type of movies that are in horror. Also have good acting because the costumes and such are kind of difficult to buy so I have to rely more on acting.\nUser: then effects\nBot: could u name a specific movie that fits one of those categories that you did like, and why you liked that kind of movie\nUser: Let me think.\nUser: The Houses October Built would be a good horror movie that I like.\nBot: why did u like that kind of movie\nUser: It felt realistic, it was scary but it also felt like it could really happen in the real world. And it also made you think too, and the acting I thought was pretty decent given that it was a low budget movie.\nBot: thanks for sharing. could u name a movie that you didn't like that fits that category, and why you didn't like that type of movie.\nBot: have you seen xmen?\nUser: The old X-Men that came out several years ago not any of the new not any of the new ones.\nBot: did you like this kind of movie?"
  },
  {
    "dataset": "SGD",
    "conv_id": 76,
    "conv_topic_label": "Topic 3: MISSING_CONTEXT / UNSUPPORTED_INTENT",
    "n_user_turns": 16,
    "n_scored_user_turns": 16,
    "avg_satisfaction": 3.3333333333333335,
    "median_satisfaction": 3.3333333333333335,
    "low_satisfaction_rate": 0.25,
    "snippet": "User: I would like you to search for event dates.\nBot: What event interests you and do you have a preferred city?\nUser: I was told Sparks vs Lynx is good and I would like to see them in Los Angeles.\nBot: Sparks vs Lynx are playing on 3 days at the Staples Center, including March 5th.\nUser: What are some other dates? Also Jojo Siwa is really good. Please look for something in NYC.\nBot: Jojo Siwa is playing on 5 days at the Forest Hills Stadium. One event date is March 2nd.\nUser: What are some other events?\nBot: Jojo Siwa is playing March 3rd at the Forest Hills Stadium.\nUser: That sounds good to me.\nBot: Would you like to purchase tickets?\nUser: Not at this time, though I would like to purchase bus tickets.\nBot: What time are you looking to leave?\nUser: Please look for a bus that departs around 10:30 am.\nBot: Where and when would you like to depart from on MArch 3rd? How many tickets do you wish to purchase?"
  },
  {
    "dataset": "SGD",
    "conv_id": 428,
    "conv_topic_label": "Topic 5: MISSING_CONTEXT / TONE_ISSUE",
    "n_user_turns": 12,
    "n_scored_user_turns": 12,
    "avg_satisfaction": 3.277777777777778,
    "median_satisfaction": 3.3333333333333335,
    "low_satisfaction_rate": 0.25,
    "snippet": "User: Find me something to do.\nBot: is there any event preference?\nUser: find me something in District of Columbia specifically in baseball sports\nBot: There is a Nationals Vs Braves game at the Nationals park on march 12th at 8 pm\nUser: that is good\nBot: should i get the tickets for it?\nUser: no, not now\nBot: any thing else?\nUser: when am i free on that day?\nBot: For March 12th you are free from 12:15 pm to 10 pm\nUser: ok good, now book me those tickets\nBot: how many should i buy?\nUser: only 1 please\nBot: please confirm: booking 1 ticket for the Nationals Vs Braves game at the Nationals park on march 12th at 8 pm in Washington D.c."
  },
  {
    "dataset": "SGD",
    "conv_id": 741,
    "conv_topic_label": "Topic 0: MISSING_CONTEXT / UNSUPPORTED_INTENT",
    "n_user_turns": 12,
    "n_scored_user_turns": 12,
    "avg_satisfaction": 3.277777777777778,
    "median_satisfaction": 3.3333333333333335,
    "low_satisfaction_rate": 0.25,
    "snippet": "User: i need to do hair cut. find a salon near by?\nBot: In which city should i search for?\nUser: I want a salon in San Fran.\nBot: I found 10 salons according to your interest. 1512 Barber shop is a nice salon in san Francisco.\nUser: What is its address and is it unisex?\nBot: Its address is 1532 20th street. It is a unisex salon.\nUser: ok thats sound good.\nBot: Whether i need to book an appointment over there?\nUser: no not now. find when am i free on 12th of March?\nBot: on March 12th you have an empty slot starting 1 pm and ends at 10:30 pm\nUser: ok thats great.\nBot: whether you like to add an event to your calendar?\nUser: no need to add the event. Book an appointment at the salon on that day and the timing is at 2:45 pm?\nBot: ok please check and confirm the following details . The name of the hair stylist is 1512 barber shop, the appointment is at 2:45 pm and the date is on March 12th."
  },
  {
    "dataset": "SGD",
    "conv_id": 998,
    "conv_topic_label": "Topic 2: MISSING_CONTEXT / TONE_ISSUE",
    "n_user_turns": 18,
    "n_scored_user_turns": 18,
    "avg_satisfaction": 3.2777777777777777,
    "median_satisfaction": 3.166666666666667,
    "low_satisfaction_rate": 0.1111111111111111,
    "snippet": "User: I want to watch a Fantasy movie at Pruneyard Cinemas\nBot: In which city do you want to watch the movie?\nUser: I want to watch it in Campbell\nBot: Do you prefer Dumbo or Hellboy?\nUser: I prefer Hellboy. What time is the show?\nBot: When would you like to watch the movie?\nUser: I'd like to watch it on 2nd of this month\nBot: On 2nd there's a show at 3:30 pm in Pruneyard Dine-In Cinemas\nUser: Yes, I't good for me!\nBot: Do you want to book tickets?\nUser: Maybe later, thanks\nBot: Do you need anything else?\nUser: Yes, I need a restaurant there\nBot: What would you like to eat?"
  },
  {
    "dataset": "SGD",
    "conv_id": 439,
    "conv_topic_label": "Topic 3: MISSING_CONTEXT / UNSUPPORTED_INTENT",
    "n_user_turns": 11,
    "n_scored_user_turns": 11,
    "avg_satisfaction": 3.242424242424242,
    "median_satisfaction": 3.3333333333333335,
    "low_satisfaction_rate": 0.2727272727272727,
    "snippet": "User: I need to get a haircut. Find a unisex salon please.\nBot: Where do you want to look it in?\nUser: Please find a salon in Oakland.\nBot: There is a salon called 17 Jewels Salon in Oakland.\nUser: That sounds great.\nBot: Do you want to book an appointment?\nUser: First I want to know what will the weather be on Monday next week?\nBot: The temperature will be around 87 degrees Fahrenheit with a chance of 11 percent of rain.\nUser: How humid will it be?\nBot: The humidity will be around 32 percent.\nUser: sounds good.\nBot: Is there anything else I can help you with?\nUser: Yes, I would like to book the salon on that day at four in the evening.\nBot: Please confirm: Booking an appointments at 17 Jewels Salon at 4 pm on March 4th"
  },
  {
    "dataset": "SGD",
    "conv_id": 51,
    "conv_topic_label": "Topic 0: MISSING_CONTEXT / UNSUPPORTED_INTENT",
    "n_user_turns": 9,
    "n_scored_user_turns": 9,
    "avg_satisfaction": 3.2222222222222223,
    "median_satisfaction": 3.0,
    "low_satisfaction_rate": 0.3333333333333333,
    "snippet": "User: Can you find me a salon in Fremont?\nBot: I've found a nice salon called 3Sixty Salon and Boutique in Fremont.\nUser: Can you find me another salon? I would like a unisex salon.\nBot: Alex'S Classic Barber Shop in Fremont is among the 8 salons I found, that you may like.\nUser: On what street is it located?\nBot: It's located at 4175, 42151 Blacow Road.\nUser: Yes, I like the sound of that. Please book me an appointment at a salon.\nBot: What date and time would you like me to book the appointment for?\nUser: I would like an appointment for next Wednesday afternoon 2:15.\nBot: Please confirm that I got everything correctly: An appointment for 2:15 next Wednesday, 2:15 pm at Alex'S Classic Barber Shop.\nUser: Sorry, I've changed my mind. I'd like the appointment to be for 3:30 in the afternoon, on the 4th of March.\nBot: Please confirm that I got everything correctly: An appointment for 3:30 pm in the afternoon, next Monday.\nUser: Yes, that sounds perfect.\nBot: Unfortunately, I was unable to book the appointment. Alex'S Classic Barber Shop, a nice salon, has an opening for next Monday at 4 pm."
  },
  {
    "dataset": "SGD",
    "conv_id": 712,
    "conv_topic_label": "Topic 3: MISSING_CONTEXT / UNSUPPORTED_INTENT",
    "n_user_turns": 17,
    "n_scored_user_turns": 17,
    "avg_satisfaction": 3.2156862745098036,
    "median_satisfaction": 3.3333333333333335,
    "low_satisfaction_rate": 0.058823529411764705,
    "snippet": "User: Would you give me some of your time to get some bus tickets, please?\nBot: Certainly. What's the date you want?\nUser: Please schedule March 10th for the trip.\nBot: Okay. Where do you want to go and at what time? Also, tell me for how many passengers.\nUser: Set that up for 1 Economy extra ticket going to SFO. The bus needs to leave at 9:15 in the morning.\nBot: All right, and what station should your bus depart from?\nUser: Make it LAX, please.\nBot: Got it. Do you want to confirm 1 ticket for an Economy extra bus ride, leaving Los Angeles on March 10th at 9:15 am and going to San Francisco?\nUser: Nope, please change that destination to SD.\nBot: Okay. Do you want to confirm a bus trip, leaving Los Angeles and going to San Diego?\nUser: Indeed, that's what I want.\nBot: Apologies. I could not get those tickets. Would a departure time of 9:20 am work for you? The ticket fare is $38.\nUser: That will be fine.\nBot: The ticket for your bus ride is confirmed."
  },
  {
    "dataset": "SGD",
    "conv_id": 220,
    "conv_topic_label": "Topic 4: UNSUPPORTED_INTENT / MISSING_CONTEXT",
    "n_user_turns": 16,
    "n_scored_user_turns": 16,
    "avg_satisfaction": 3.2125,
    "median_satisfaction": 3.3,
    "low_satisfaction_rate": 0.3125,
    "snippet": "User: There is a conference for me and I am in need of rental car of any type? Please help.\nBot: When will you pick it up and till which date you will be using i?\nUser: I will be using it till the 8th and intend to pick up from Vegas.\nBot: When will you pick it up?\nUser: At 11 am probably.\nBot: On what date do you need it?\nUser: I should get it from March 2nd.\nBot: There are 6 cars awaiting you. A Compact car Cooper at McCarran International Airport can be picked on March 2nd. Does it find suitable?\nUser: Any other is available?\nBot: Another one is a Standard car Elantra at McCarran International Airport. You can pick it up on March 2nd.\nUser: How much will it cost?\nBot: You have to pay $192 in total.\nUser: Great, thank you.\nBot: Shall I reserve the car for you?"
  },
  {
    "dataset": "CCPE",
    "conv_id": 128,
    "conv_topic_label": "Topic 5: MISSING_CONTEXT / TONE_ISSUE",
    "n_user_turns": 13,
    "n_scored_user_turns": 13,
    "avg_satisfaction": 3.2115384615384617,
    "median_satisfaction": 3.25,
    "low_satisfaction_rate": 0.3076923076923077,
    "snippet": "Bot: What kind of movies do you enjoy and why?\nUser: I enjoy action movies.\nUser: Because they're fun to watch.\nBot: Is there a particular film you enjoy?\nUser: Yes. I enjoy watching the the Ninja Turtle movie.\nBot: What did you like about that film?\nUser: That film has a lot of action in it. It has a lot of action where it's fighting bad guys.\nUser: first time in the world\nBot: Is there a particular movie you don't enjoy?\nUser: I do not enjoy\nUser: 2010 Moby Dick\nBot: What didn't you like about the film?\nUser: The film was boring. It was on It was on It was on a ship. It was just on the submarine. It just wasn't wasn't fun to watch.\nUser: That's why it's not a good movie."
  },
  {
    "dataset": "SGD",
    "conv_id": 423,
    "conv_topic_label": "Topic 4: UNSUPPORTED_INTENT / MISSING_CONTEXT",
    "n_user_turns": 15,
    "n_scored_user_turns": 15,
    "avg_satisfaction": 3.2,
    "median_satisfaction": 3.25,
    "low_satisfaction_rate": 0.2,
    "snippet": "User: I need a dentist!\nBot: Which city should I look in?\nUser: In Daly City.\nBot: I found 1 dentist in Daly City. It's called Hillcrest Family Dental Care.\nUser: What's their location?\nBot: They are located on 343 Gellert Boulevard # C.\nUser: Do they have cosmetic services? What's their number?\nBot: No, they don't offer cosmetic services. Their number is 650-992-7001.\nUser: Thanks for the info.\nBot: Do you want to make an appointment?\nUser: Maybe later?\nBot: Can I assist you with something else?\nUser: When am I free on March 8th?\nBot: On March 8th, you are free from 2:30 pm to 7 pm."
  },
  {
    "dataset": "SGD",
    "conv_id": 888,
    "conv_topic_label": "Topic 4: UNSUPPORTED_INTENT / MISSING_CONTEXT",
    "n_user_turns": 12,
    "n_scored_user_turns": 12,
    "avg_satisfaction": 3.1944444444444446,
    "median_satisfaction": 3.3333333333333335,
    "low_satisfaction_rate": 0.16666666666666666,
    "snippet": "User: Please help me find an apartment.\nBot: How many bedrooms do you want in the apartment?\nUser: I'd like three bedrooms please.\nBot: In which area are you trying to find the apartment?\nUser: Find me one in Fremont.\nBot: There are 10 nice apartments in that locality. Alborada apartments is a good property with 3 bedrooms and 2 baths. The monthly rent is $3,900 and it is located at 1001 Beethoven Common.\nUser: Thank you, that sounds like a good apartment.\nBot: Shall I schedule a visit to the property, for you?\nUser: No, not now. Maybe later.\nBot: Is there anything else I can do for you?\nUser: When do I have some free time on that day?\nBot: Which date are you referring to?\nUser: I want to know about the 9th please.\nBot: On March 9th, you are free between 9 pm and 9:30 pm."
  },
  {
    "dataset": "CCPE",
    "conv_id": 116,
    "conv_topic_label": "Other / Uncategorized",
    "n_user_turns": 14,
    "n_scored_user_turns": 14,
    "avg_satisfaction": 3.1785714285714284,
    "median_satisfaction": 3.25,
    "low_satisfaction_rate": 0.0,
    "snippet": "Bot: what are some movie genres that u like?\nUser: I like thrillers, sci-fi, and some comedies.\nBot: why do you like sci fi movies?\nUser: I kind of like it because it you know takes you to a different place. I wish some of the worlds were actually like that.\nBot: i see\nBot: What is one of your favorite movies?\nUser: One of my favorite movies would be Star Wars.\nBot: what do you think of the new star wars films that are being released\nUser: First, I was skeptical. I didn't really like the first new one. But since then, I think that they're pretty awesome. I really like the Han Solo.\nBot: What type of movies do you not like?\nUser: I like most movies. I'm not really Rom-coms are my least favorite.\nBot: why's that?\nUser: I don't know. They're kind of boring. I like some of them, but unless I'm with a girlfriend, I don't really like them.\nBot: have you seen the movie Now You See Me?"
  },
  {
    "dataset": "SGD",
    "conv_id": 309,
    "conv_topic_label": "Topic 3: MISSING_CONTEXT / UNSUPPORTED_INTENT",
    "n_user_turns": 18,
    "n_scored_user_turns": 18,
    "avg_satisfaction": 3.177777777777778,
    "median_satisfaction": 3.3,
    "low_satisfaction_rate": 0.1111111111111111,
    "snippet": "User: I am looking for dates to an event in NYC, I was told Joe Hisaishi is pretty good.\nBot: Joe Hisaishi is on At Stern Auditorium / Perelman Stage on March 9th.\nUser: That sounds fine.\nBot: Would you like some tickets?\nUser: Not right now.\nBot: What else can I do for you?\nUser: I would like you to check bus timetables for a bus going there on March 4th for three passengers.\nBot: Where are you departing from?\nUser: From Philadelphia city.\nBot: There are economy tickets available for a bus leaving at 8:30 am which cost $25. There are also 8 other options.\nUser: What station does it depart from and arrive at?\nBot: It departs from Intercity Terminal and arrives at Port Authority Station.\nUser: That suits fine.\nBot: Would you like tickets?"
  },
  {
    "dataset": "CCPE",
    "conv_id": 382,
    "conv_topic_label": "Topic 2: MISSING_CONTEXT / TONE_ISSUE",
    "n_user_turns": 18,
    "n_scored_user_turns": 18,
    "avg_satisfaction": 3.1666666666666665,
    "median_satisfaction": 3.25,
    "low_satisfaction_rate": 0.16666666666666666,
    "snippet": "Bot: hello\nUser: Hi.\nBot: What kind of movies do you like?\nUser: Let's say comedy movies.\nBot: Can you name a particular movie you like?\nUser: Eight Crazy Nights\nBot: what did you like about it?\nUser: I thought it was funny.\nBot: what else?\nUser: I'm\nUser: Well, in addition to finding it funny, I also found it funny.\nUser: But that aside, it was a good Adam Sandler movie cuz it was funny.\nBot: can you tell me more?\nUser: I thought that the acting was pretty good, I thought it was kind of funny that Adam's family did a lot of the voices."
  },
  {
    "dataset": "CCPE",
    "conv_id": 470,
    "conv_topic_label": "Topic 5: MISSING_CONTEXT / TONE_ISSUE",
    "n_user_turns": 14,
    "n_scored_user_turns": 14,
    "avg_satisfaction": 3.142857142857143,
    "median_satisfaction": 3.25,
    "low_satisfaction_rate": 0.07142857142857142,
    "snippet": "Bot: what kind of movies do you enjoy watching\nUser: comedy\nBot: why is that\nUser: They are funny and entertaining.\nBot: name a specific movie that fits that category that you like, and tell me why you like it\nUser: I like the movie Step Brothers with Will Ferrell and the other man. It was very funny, humorous movie. I was laughing the entire time.\nBot: i'm well aware of words like funny and humorous already. please add more description so i can learn more vocabulary\nUser: The movie had a great story, and the characters were all very unique, and each one had their own way of being funny.\nBot: thanks. and could you talk about a movie you didn't like that fit that movie category\nUser: That would be\nUser: Probably it's the movie Harold & Kumar Go to White Castle.\nBot: why didn't you like that type of movie\nUser: I didn't like the characters. There was nothing interesting about them. And I didn't find the movie funny.\nBot: have you seen the movie x men"
  },
  {
    "dataset": "SGD",
    "conv_id": 413,
    "conv_topic_label": "Topic 4: UNSUPPORTED_INTENT / MISSING_CONTEXT",
    "n_user_turns": 14,
    "n_scored_user_turns": 14,
    "avg_satisfaction": 3.142857142857143,
    "median_satisfaction": 3.0,
    "low_satisfaction_rate": 0.21428571428571427,
    "snippet": "User: Hey! Please can you find me a rental car on March 5th?\nBot: Sure, where do you wish to pick up the car?\nUser: Might be at San Jose.\nBot: From when do you wish to rent the car?\nUser: I wish to rent the car on 2nd of March?\nBot: Okay, at what time you need the car?\nUser: I will be able to pick up the car at evening 4:30.\nBot: Okay, there is a nice Standard car, Chevrolet Cruze is available at Diridon Station for pick up on March 2nd. Do you wish to rent this car?\nUser: Yup, sounds good.\nBot: Do you want me to assist with anything else?\nUser: Yup, Please can you help me to book this car?\nBot: Sure. Please can you confirm me that you wish to book the Standard Car which is available for pick up from Diridon Station on March 2nd at 4:30 pm and you will drop the car at March 5th, right?\nUser: Yup, sounds good.\nBot: Okay! I've booked the rental car for you."
  },
  {
    "dataset": "SGD",
    "conv_id": 354,
    "conv_topic_label": "Topic 3: MISSING_CONTEXT / UNSUPPORTED_INTENT",
    "n_user_turns": 11,
    "n_scored_user_turns": 11,
    "avg_satisfaction": 3.1363636363636362,
    "median_satisfaction": 3.25,
    "low_satisfaction_rate": 0.09090909090909091,
    "snippet": "User: Can you help me find event tickets?\nBot: Sure, where? And how many tickets?\nUser: I need 4 tickets, preferably in Chicago\nBot: What about the date? Anything you had in mind?\nUser: I want it on the 1st of March please\nBot: What kind of event do you want to go to?\nUser: I'm a baseball fan, so the White Sox Vs Tigers I hear is gonna be great\nBot: Cool, so 4 tickets for today in Chicago for the White Sox Vs Tigers game?\nUser: Actually scratch that, let's do the Giants Vs Marlins instead\nBot: So 4 tickets to the Giants Vs Marlins?\nUser: Someone dropped out, so I just need three tickets\nBot: Ok so 3 tickets for that game today.\nUser: Yes that's perfect\nBot: Sorry but I couldn't get those tickets. Can I try something else for you?"
  },
  {
    "dataset": "SGD",
    "conv_id": 365,
    "conv_topic_label": "Topic 1: MISSING_CONTEXT / TONE_ISSUE",
    "n_user_turns": 21,
    "n_scored_user_turns": 21,
    "avg_satisfaction": 3.1269841269841274,
    "median_satisfaction": 3.0,
    "low_satisfaction_rate": 0.23809523809523808,
    "snippet": "User: Hey, could you help me find a good comedy movie to watch?\nBot: Sure, in what location?\nUser: I'd like to see a movie in Moraga.\nBot: Okay, how about Missing Link?\nUser: Missing Link sounds great, thanks.\nBot: Should I buy your tickets?\nUser: No, not right now thanks.\nBot: Okay, is there anything else?\nUser: Can you find me a restaurant in Moraga too?\nBot: Sure, what kind of food?\nUser: I'd like a quick meal, thanks.\nBot: Okay, I found 1 applicable restaurant in Moraga. How about Mountain Mike's Pizza?\nUser: Sure, that sounds great. What time is Missing Link showing on the 1st?\nBot: There's just 1 showtime on that day, at 7 pm at Rheem Theatre."
  },
  {
    "dataset": "SGD",
    "conv_id": 736,
    "conv_topic_label": "Topic 5: MISSING_CONTEXT / TONE_ISSUE",
    "n_user_turns": 8,
    "n_scored_user_turns": 8,
    "avg_satisfaction": 3.125,
    "median_satisfaction": 3.0,
    "low_satisfaction_rate": 0.25,
    "snippet": "User: Can you please play some Ben Platt songs?\nBot: What song should I play?\nUser: The song is called Bad Habit.\nBot: Please confirm the following: Play Bad Habit on the TV.\nUser: Yes, that is correct. What album is that on?\nBot: The song has started. It is off the album Sing to me Instead.\nUser: Thank you. I am looking for a sports event near Berkeley on Wednesday next week. Is there anything interesting to do?\nBot: I found 1 event for you. The Golden Bears Vs Trojans is taking place at the California Memorial Stadium on March 6th at 6 pm.\nUser: That sounds great.\nBot: Should I purchase tickets for you?\nUser: No thank you, not right now.\nBot: Can I help you with anything else?\nUser: No thank you. Thanks for your help.\nBot: Okay, have a great day."
  },
  {
    "dataset": "SGD",
    "conv_id": 451,
    "conv_topic_label": "Topic 4: UNSUPPORTED_INTENT / MISSING_CONTEXT",
    "n_user_turns": 23,
    "n_scored_user_turns": 23,
    "avg_satisfaction": 3.101449275362319,
    "median_satisfaction": 3.0,
    "low_satisfaction_rate": 0.13043478260869565,
    "snippet": "User: Hi, could you help me search for some take-out food which is average priced in San Mateo?\nBot: Sure, would you like Mr Pizza Man San Mateo, which is located in San Mateo.\nUser: Do they have live music and do they serve liquor there?\nBot: No they do not play live music and serve alcohol.\nUser: Are there any alternative restaurants which serves alcohol?\nBot: Sure, there is 1 restaurant in San Mateo called North Beach Pizza.\nUser: Yes, I am fine with that.\nBot: Would you like me to make a reservation for you?\nUser: Perhaps at a later time. Thanks!\nBot: Sure, could I further assist you then?\nUser: Could you help me find a salon in that area too?\nBot: Are you referring to the San Mateo area?\nUser: Yes, I am.\nBot: There is a nice salon called Elite Hair Design in the San Mateo area."
  },
  {
    "dataset": "SGD",
    "conv_id": 610,
    "conv_topic_label": "Topic 4: UNSUPPORTED_INTENT / MISSING_CONTEXT",
    "n_user_turns": 23,
    "n_scored_user_turns": 23,
    "avg_satisfaction": 3.101449275362319,
    "median_satisfaction": 3.0,
    "low_satisfaction_rate": 0.2608695652173913,
    "snippet": "User: find me a place to eat.\nBot: What kind of food are you looking for Mexican or Italian or something else?\nUser: Malaysian will be good\nBot: which city to look in?\nUser: Search in Milpitas\nBot: There is the Banana leaf restaurant in Milpitas\nUser: That is ok\nBot: should i book a table here?\nUser: no, not now\nBot: Any thing else?\nUser: Find me a unisex salon in Milpitas\nBot: i got 4 of them. Milpitas has Apple Salon Hair & Nails\nUser: whats the address?\nBot: Its 1216 South Abel Street"
  },
  {
    "dataset": "CCPE",
    "conv_id": 391,
    "conv_topic_label": "Topic 2: MISSING_CONTEXT / TONE_ISSUE",
    "n_user_turns": 11,
    "n_scored_user_turns": 11,
    "avg_satisfaction": 3.090909090909091,
    "median_satisfaction": 3.0,
    "low_satisfaction_rate": 0.09090909090909091,
    "snippet": "Bot: What kinds of movies do you like?\nUser: I like romantic comedies. I like comedies and dramas.\nBot: Cool, why do you like romantic comedies?\nUser: Oh, I can just relate to them. They keep my interest. They make me forget about you know, my real problems in life.\nBot: I see, is there a particular movie that you like?\nUser: Nothing specific. I just really like them all.\nBot: Well, how about a movie you disliked?\nUser: Let me think about that for a minute\nUser: I didn't really like.\nUser: Crazy Stupid Love, that was not a very good movie.\nBot: Why didn't you like crazy stupid love?\nUser: The acting wasn't very good and it wasn't very convincing.\nBot: Alright, have you then seen Crazy Rich Asians ?\nUser: I haven't but I heard it was good."
  },
  {
    "dataset": "SGD",
    "conv_id": 433,
    "conv_topic_label": "Topic 1: MISSING_CONTEXT / TONE_ISSUE",
    "n_user_turns": 15,
    "n_scored_user_turns": 15,
    "avg_satisfaction": 3.0833333333333335,
    "median_satisfaction": 3.25,
    "low_satisfaction_rate": 0.2,
    "snippet": "User: Can you find me flights with Alaska Airlines?\nBot: Where are you departing from and travelling to? What date will you be departing?\nUser: I am travelling on March 9th from Vancouver, BC to Seattle, WA.\nBot: There is an Alaska Airlines flight that leaves at 12 pm and has 1 stop, costing $222 altogether.\nUser: Can I get it refunded if need be and what time will it arrive?\nBot: It arrives at 8:12 pm but sorry it is not refundable.\nUser: Are there any other options I actually prefer united Airlines.\nBot: There is 1 flight with United Airlines which has 1 stop and it departs at 12:30 pm. It costs $255.\nUser: That flight suits me fine.\nBot: Would you like me to purchase a ticket for you?\nUser: No i do not.\nBot: Can I assist you with anything more?\nUser: Could you check buses travelling there?\nBot: Do yu want to depart on March 9th?"
  },
  {
    "dataset": "CCPE",
    "conv_id": 281,
    "conv_topic_label": "Topic 1: MISSING_CONTEXT / TONE_ISSUE",
    "n_user_turns": 17,
    "n_scored_user_turns": 17,
    "avg_satisfaction": 3.0784313725490198,
    "median_satisfaction": 3.3333333333333335,
    "low_satisfaction_rate": 0.23529411764705882,
    "snippet": "Bot: What kind of movies to you like, and why do you like this type of movie?\nUser: I like a science fiction movies, and I like them because they're creative and provide nice visual effects.\nBot: Can you name a particular movie that you like?\nUser: Avatar\nBot: Can you give me a couple of reasons why you like this movie?\nUser: It was nice cinematography. It had a good plot and good visual effects.\nBot: Can you name a movie that you do not like?\nUser: How to Lose a Guy in 10 Days\nBot: What do you dislike about this movie? please give me 2 reasons.\nUser: awful plot and bad acting\nBot: Do you like the movie Black Klansman?\nUser: Yes.\nBot: What do you like about this movie? 2 reasons please\nUser: I like the story and I liked the"
  },
  {
    "dataset": "CCPE",
    "conv_id": 199,
    "conv_topic_label": "Topic 2: MISSING_CONTEXT / TONE_ISSUE",
    "n_user_turns": 18,
    "n_scored_user_turns": 18,
    "avg_satisfaction": 3.0694444444444446,
    "median_satisfaction": 3.0,
    "low_satisfaction_rate": 0.2222222222222222,
    "snippet": "Bot: what kind of movies do you like?\nUser: I like a lot of action movies. And sometimes animation if they fit right with my personal liking.\nBot: what do you like about these kinds of movies?\nUser: Animation you could do a whole bunch of stuff that you cannot do with live action. Sometimes CGI is never the best option and the best way to go about like impossible stuff is do it in animation because the idea's limitless on what you can do.\nBot: can you name a movie that you really liked?\nUser: Last movie I really liked was Justice League.\nBot: what did you like about this movie?\nUser: Even though they give bad stuff about the bad CGI in the movie, it's still a guilty pleasure of mine. I'm a real DC fan even though Marvel is good, but I still enjoy DC a lot more cuz their heroes and are a lot more and have more character to them. It was great seeing Batman played by Ben Affleck be pretty great. Superman was really good.\nUser: Wonder Woman was enjoyable, and the introduction of Aquaman and Cyborg and Flash really made the movie interesting to watch. Especially Aquaman with his funny quotes here and there.\nBot: nice, what kind of movies do you dislike?\nUser: I don't like horror movies at all. They're not my go to at all, I wouldn't watch one.\nBot: what do you dislike about them?\nUser: I just don't like scary things in general. One, they give me nightmares sometimes. And I don't really like having nightmares because\nUser: I sometimes forget they're dreams and cuz they like look so real sometimes."
  },
  {
    "dataset": "SGD",
    "conv_id": 432,
    "conv_topic_label": "Topic 4: UNSUPPORTED_INTENT / MISSING_CONTEXT",
    "n_user_turns": 15,
    "n_scored_user_turns": 15,
    "avg_satisfaction": 3.05,
    "median_satisfaction": 3.0,
    "low_satisfaction_rate": 0.4,
    "snippet": "User: can you show me cool places to go?\nBot: where should i look?\nUser: anywhere in new york city.\nBot: there's a performing arts venue on 92nd street y.\nUser: what's their number?\nBot: you can call them at (212) 415-5788.\nUser: are there any other tourist attraction type places arounf?\nBot: there's a tourist attraction near called the balto statue.\nUser: is it good for kids?\nBot: no, not really.\nUser: okay, cool that's fine.\nBot: is there anything else?\nUser: when am i free on march 8th?\nBot: on march 8th you are free from 12:15 pm until 8 pm."
  },
  {
    "dataset": "SGD",
    "conv_id": 339,
    "conv_topic_label": "Topic 4: UNSUPPORTED_INTENT / MISSING_CONTEXT",
    "n_user_turns": 20,
    "n_scored_user_turns": 20,
    "avg_satisfaction": 3.033333333333333,
    "median_satisfaction": 3.0,
    "low_satisfaction_rate": 0.2,
    "snippet": "User: I would like to search round trip flights.\nBot: What is your date of return and the place of boarding?\nUser: I will be leaving from LAX and will return on March 13th.\nBot: What is your destination?\nUser: I will be going to Phoenix, AZ.\nBot: What would be your date of departure?\nUser: My date of departure would be the 2nd.\nBot: I found an American Airlines flight leaving at 7:50 am and the return flight departs at 7:35 am. The ticket costs $105.\nUser: Can you confirm whether the ticket is refundable?\nBot: Sorry, The ticket is non-refundable.\nUser: Can you look for premium Economy tickets in any other flight?\nBot: There are 1 flight suitable to you. It is a Southwest Airlines flight which leaves at 11:50 pm and the return flight departs at 7:05 am and the ticket costs $148.\nUser: That sounds good to me. Would you help in booking 3 tickets in that flight?\nBot: Please confirm: You want me to book 3 premium Economy tickets in Southwest Airlines which leaves from Los Angeles at 11:50 pm on March 2nd to Phoenix. The return flight departs at 7:05 am on March 13th."
  },
  {
    "dataset": "CCPE",
    "conv_id": 419,
    "conv_topic_label": "Topic 1: MISSING_CONTEXT / TONE_ISSUE",
    "n_user_turns": 19,
    "n_scored_user_turns": 19,
    "avg_satisfaction": 3.0210526315789474,
    "median_satisfaction": 3.0,
    "low_satisfaction_rate": 0.21052631578947367,
    "snippet": "Bot: What kind of movies to you like, and why do you like this type of movie?\nUser: I like action movies. They are sort of exciting, usually fun and really quite an escape from, you know, your real life. It's usually not something you are going to be encountering. So it's really an experience you are not going to be you can really embrace yourself and and not think, \"Oh, this is real life and it's about to happen.\" So it's it could be a lot of fun, very exciting\nUser: And sort of a real thing you can immerse yourself in for a few hours.\nBot: Can you name a particular movie that you like?\nUser: Sure. I love Bourne Ultimatum.\nBot: Can you give me a couple of reasons why you like this movie?\nUser: Sure. Bourne Ultimatum is a excellent movie on literally every front. It is a excellent acting, excellent writing, excellent direction. The direction is usually overlooked but the directing is phenomenal and it helps make the movie absolutely perfect. It is a very tight movie. There is barely a a a second that is wasted.\nUser: and I don't know. Let's say the movie is like 2 hours or 2 hours and 20 minutes or something. It feels like it goes by so quickly because it's just It has such a rhythm to it, and you're just immersed and involved with what's going on. And it's a character you can root for, and just people you like And this is a continuing series, so you really know the character already, and you're really there to root them on.\nBot: Can you name a movie that you do not like?\nUser: Yes, unlike so many I did not like Dark Knight.\nBot: What do you dislike about this movie? Please give me 2 reasons.\nUser: Sure, Dark Knight is a Batman movie, and Batman already had an original, and it's so the problem of Dark Knight for me is is not true to the comic, and we saw a movie that was great and true to the comic. So, I don't like the joker character, it's not that bad. Keith Ledger was bad as the joker necessarily, not exactly, it's that it was not written very poorly. It was so dark.\nUser: So the two things I really don't like are it wasn't funny which is what the joke was supposed to be and the writing was extremely disappointing and very dark so just it was a a just bad all around for me.\nBot: Do you like the movie Guardians of the Galaxy?"
  },
  {
    "dataset": "SGD",
    "conv_id": 259,
    "conv_topic_label": "Topic 1: MISSING_CONTEXT / TONE_ISSUE",
    "n_user_turns": 12,
    "n_scored_user_turns": 12,
    "avg_satisfaction": 3.0208333333333335,
    "median_satisfaction": 3.125,
    "low_satisfaction_rate": 0.16666666666666666,
    "snippet": "User: Can you please check the balance of my savings account?\nBot: Sure, there's $18,982.10 in my savings account.\nUser: OK, thank you.\nBot: Do you want me to make a transfer for you?\nUser: No, not at this moment.\nBot: Is there anything else I could do for you?\nUser: Yes, please find me a movie to watch online!\nBot: What kind would you prefer.\nUser: I'd really like a Thriller.\nBot: There's 2 which you may like - Hotel Mumbai and Pet Sematary.\nUser: I think Hotel Mumbai is awesome.\nBot: Shall I play it?\nUser: Yes, please do.\nBot: Can you please confirm that you want me to play Hotel Mumbai without subtitles?"
  },
  {
    "dataset": "SGD",
    "conv_id": 861,
    "conv_topic_label": "Topic 2: MISSING_CONTEXT / TONE_ISSUE",
    "n_user_turns": 16,
    "n_scored_user_turns": 16,
    "avg_satisfaction": 3.0208333333333335,
    "median_satisfaction": 3.0,
    "low_satisfaction_rate": 0.3125,
    "snippet": "User: Please help me find an Adventure movie and I want to watch it on Imax show.\nBot: Where are you located?\nUser: Please search movies in Healdsburg.\nBot: I found 1 and it's Shazam!.\nUser: What time I can the Shazam? I prefer watching it on Saturday this week at Raven Film Center.\nBot: I got 1 showtimes for the movie and it's at 4 pm in Raven Film Center.\nUser: How much would the ticket cost?\nBot: It's $11 per person.\nUser: Were is the theater located?\nBot: It's at 415 Center Street.\nUser: Good.\nBot: Will I buy you tickets now?\nUser: Not now.\nBot: Anything else I can help you with?"
  },
  {
    "dataset": "CCPE",
    "conv_id": 85,
    "conv_topic_label": "Other / Uncategorized",
    "n_user_turns": 7,
    "n_scored_user_turns": 7,
    "avg_satisfaction": 3.0,
    "median_satisfaction": 3.0,
    "low_satisfaction_rate": 0.0,
    "snippet": "Bot: What kinds of movies do you like?\nUser: I like adventure movies.\nBot: Well, tell me why do you like adventure movies\nUser: Mostly because it's always a lot of action, a lot of If you're talking about Westerns, there's a lot of horses going around, a lot of gunshots, but adventure and exploring is very important.\nBot: cool, how about a movie you liked?\nUser: I think I like the Mission: Impossible one. It was very very quick and fast-paced.\nBot: Interesting, is there a movie you did not like?\nUser: I did not like the latest Jumanji movie that came out recently. It was a little lot childish.\nBot: Ok, then have you seen the movie John Wick?\nUser: Yes, I believe I did see that one. That was a very good movie.\nBot: What is it about this kinds of movies that you like or dislike?\nUser: I think it's the fast-paced action that's going on that I really like about it so much.\nBot: Wonderful. thank you for sharing. Good bye.\nUser: OVERALL"
  },
  {
    "dataset": "CCPE",
    "conv_id": 268,
    "conv_topic_label": "Topic 5: MISSING_CONTEXT / TONE_ISSUE",
    "n_user_turns": 16,
    "n_scored_user_turns": 16,
    "avg_satisfaction": 3.0,
    "median_satisfaction": 3.0,
    "low_satisfaction_rate": 0.1875,
    "snippet": "Bot: What kind of movies to you like, and why do you like this type of movie?\nUser: I like comedies and epics, like Lord of the Rings.\nBot: Can you name a particular movie that you like?\nUser: Lord of the Rings: Return of the King\nBot: Can you give me a couple of reasons why you like this movie?\nUser: I really like all the cool fights in it. I like Frodo as a character. He's really interesting.\nBot: Can you name a movie that you do not like?\nUser: How about\nUser: Glow or whatever that movie was with the girl figure skaters\nBot: What do you dislike about this movie? Please give me 2 reasons.\nUser: I don't like the chick flicks. The humor doesn't really do it for me, and it's just really boring. The pacing is really bad.\nBot: Do you like the movie Forrest Gump?\nUser: Yeah, that's a great movie.\nBot: What do you like about this movie? Please give me 2 reasons."
  },
  {
    "dataset": "CCPE",
    "conv_id": 249,
    "conv_topic_label": "Other / Uncategorized",
    "n_user_turns": 13,
    "n_scored_user_turns": 13,
    "avg_satisfaction": 2.9846153846153842,
    "median_satisfaction": 3.2,
    "low_satisfaction_rate": 0.0,
    "snippet": "Bot: What type of movies do you enjoy?\nUser: From time to time, I really like to watch some indie films.\nBot: What appeals to you with these type of movies?\nUser: They usually have off pitch stories and interesting characters. So, it's kind of off the beaten path.\nBot: Is there a specific movie you enjoy from this genre?\nUser: One that comes to mind is Oldboy.\nBot: What did you like about this movie?\nUser: It was really It was really crazy. I mean, just there's a lot of crazy things that happen in it. And the you know It was just a really intriguing story.\nBot: Are there any type of movies that you don't enjoy?\nUser: Yeah, I'm not a huge fun of of live action family movies.\nBot: What about these movies is unappealing?\nUser: They're usually just too silly for me to take seriously. I You know, the plots are usually one-dimensional.\nBot: Is there a specific movie that you heavily dislike?\nUser: A movie that I heavily dislike? Let me think for a minute. I think something like"
  },
  {
    "dataset": "CCPE",
    "conv_id": 368,
    "conv_topic_label": "Topic 5: MISSING_CONTEXT / TONE_ISSUE",
    "n_user_turns": 14,
    "n_scored_user_turns": 14,
    "avg_satisfaction": 2.9523809523809526,
    "median_satisfaction": 3.0,
    "low_satisfaction_rate": 0.14285714285714285,
    "snippet": "User: Hello.\nBot: Hello there! Mind if I ask a few questions about movies?\nUser: Sure, go ahead.\nBot: What kind of movies do you like? Any specific genre?\nUser: I like sci-fi.\nBot: Is there a movie you can name that you really like?\nUser: I really like the movie Inception.\nBot: And can you tell me what you liked about those types of movies?\nUser: I like I like how they portray a world that could be our own. You know It's not exactly fantasy, because it could actually be It could actually happen in our near future. You know, I just feel like I feel like I could get lost in the movie, in the story line and I just forget about my own boring life.\nBot: Thanks! Your details are awesome.\nUser: Thank you. Thank you so much for that.\nBot: now that I know what movie you like, can you name one you don't like? What would be last on your list?\nUser: I really I don't like romantic comedies. I really don't like that movie Maid in Manhattan with Jennifer Lopez. I think it's such a bad movie. It's not funny. It's not entertaining at all.\nUser: It was I just found it really boring and generic and just I wasn't interested. I was just really bored."
  },
  {
    "dataset": "CCPE",
    "conv_id": 491,
    "conv_topic_label": "Topic 5: MISSING_CONTEXT / TONE_ISSUE",
    "n_user_turns": 13,
    "n_scored_user_turns": 13,
    "avg_satisfaction": 2.948717948717949,
    "median_satisfaction": 3.0,
    "low_satisfaction_rate": 0.15384615384615385,
    "snippet": "Bot: What type of movies do you like?\nUser: thriller and mysteries\nBot: why do you like mysteries?\nUser: Just how unpredictable the plot is and trying to figure out how it ends before the movie ends. I like to just enjoy the writer trying to figure out how its going to end.\nBot: What is one of your favorite movies?\nUser: The Usual Suspects\nBot: what did you think of the ending? personally i thought it was good\nUser: The ending was amazing. I mean, it all came together perfectly.\nBot: what else did you like about the movie?\nUser: The actors, how well they played their characters. The director, and how he seemingly just It it was just so perfect how they put it all together.\nBot: What type of movies do you not like?\nUser: I don't like romance movies.\nBot: why is that?\nUser: A bit corny, boring."
  },
  {
    "dataset": "CCPE",
    "conv_id": 336,
    "conv_topic_label": "Topic 5: MISSING_CONTEXT / TONE_ISSUE",
    "n_user_turns": 12,
    "n_scored_user_turns": 12,
    "avg_satisfaction": 2.9444444444444446,
    "median_satisfaction": 3.0,
    "low_satisfaction_rate": 0.08333333333333333,
    "snippet": "Bot: what kind of movies do u like watching\nUser: I like to watch dramatic movies.\nBot: why is that\nUser: I'd like to feel connect to characters and cry you just have to feel real.\nBot: could u name a specific movie that fits that category, and tell me why you like this kind of movie\nUser: I really like 12 Years a Slave.\nUser: Cuz it was like dramatic but also real, and it made me remember my history.\nBot: could u tell me a little more\nUser: It made me very emotional but also very aware of what was going on in the world, and I would like that.\nBot: thanks. could u also tell me about a movie that fits that category that you didn't like\nUser: I did not like\nUser: First Man, I think it was slow, and just I mean, I know it was realistic, but it just was still slow in dramaticness, that I didn't care about\nBot: what do u mean by slow\nUser: Mainly, it just dragged on, and didn't get to the real point for a long time."
  },
  {
    "dataset": "SGD",
    "conv_id": 607,
    "conv_topic_label": "Topic 4: UNSUPPORTED_INTENT / MISSING_CONTEXT",
    "n_user_turns": 18,
    "n_scored_user_turns": 18,
    "avg_satisfaction": 2.9444444444444446,
    "median_satisfaction": 3.0,
    "low_satisfaction_rate": 0.1111111111111111,
    "snippet": "User: i am not feeling well. i need to consult a doctor. find a doctor in and around near by?\nBot: in which city should i search for?\nUser: find doctor in the city walnut creek?\nBot: what kind of doctor are you search for?\nUser: i need gynecologist.\nBot: i found 10 results. how about babak edraki md located in walnut creek? ,he is a gynecologist\nUser: is there anyone else? find some doctor in napa? , i prefer a general practitioner.\nBot: how about alex de moraes, MD located in napa? they are a general practitioner.\nUser: ok that works for me.\nBot: whether you would like to schedule a visit?\nUser: no, i don't want to visit.\nBot: whether need to find any other thing?\nUser: please book a cab to go there. i prefer luxury ride and number of passenger is 2.\nBot: whether you will go through 935 trancas street?"
  },
  {
    "dataset": "CCPE",
    "conv_id": 80,
    "conv_topic_label": "Topic 2: MISSING_CONTEXT / TONE_ISSUE",
    "n_user_turns": 18,
    "n_scored_user_turns": 18,
    "avg_satisfaction": 2.9259259259259256,
    "median_satisfaction": 2.833333333333333,
    "low_satisfaction_rate": 0.2222222222222222,
    "snippet": "Bot: What kind of movies do you like, and why do you like this type of movie?\nUser: Comedies, I like to laugh.\nBot: Can you name a particular movie that you like?\nUser: Liar, Liar\nBot: Jim Carrey was really funny.\nUser: I agree.\nBot: Can you give me a couple of reasons why you like this movie?\nUser: I like Jim Carrey in the movie. He's funny. Also, it has a good message of lying is bad.\nBot: Can you name a movie that you do not like?\nUser: I can't think of anything.\nBot: please try to recall the last movie that turned you off\nUser: [inaudible]\nBot: What do you dislike about this movie? please give me 2 reasons.\nUser: It was too gory. I couldn't get into the movie. Made me feel sick."
  },
  {
    "dataset": "SGD",
    "conv_id": 70,
    "conv_topic_label": "Topic 4: UNSUPPORTED_INTENT / MISSING_CONTEXT",
    "n_user_turns": 10,
    "n_scored_user_turns": 10,
    "avg_satisfaction": 2.925,
    "median_satisfaction": 3.125,
    "low_satisfaction_rate": 0.2,
    "snippet": "User: Hello! Can you help me find an apartment?\nBot: I'd be happy to help. Where are you interested in searching for an apartment? How many bedrooms do you need?\nUser: I'd like to find a two bedroom property in Vacaville.\nBot: I can recommend the Alamo Garden Apartments at 1501 Alamo Drive. It has 2 beds, 1 bath and is $2,550 per month.\nUser: Is it a furnished apartment?\nBot: No, it is not.\nUser: Great! Can you tell me if I have an available time on the 10th of this month to go and look at it?\nBot: You have some free time available on March 10th starting at 8:30 pm and ending at midnight.\nUser: That works for me.\nBot: Would you like me to add that to your calendar?\nUser: No, I don't need to make an event for it.\nBot: Is there anything else I can assist you with today?\nUser: Yes, I'd like to schedule a viewing of the apartment.\nBot: You'd like to visit Alamo Garden Apartments on March 10th. Is that correct?"
  },
  {
    "dataset": "CCPE",
    "conv_id": 432,
    "conv_topic_label": "Other / Uncategorized",
    "n_user_turns": 7,
    "n_scored_user_turns": 7,
    "avg_satisfaction": 2.9047619047619047,
    "median_satisfaction": 3.0,
    "low_satisfaction_rate": 0.0,
    "snippet": "Bot: What type of movies do you like?\nUser: I like dramas a lot. I think those are the most interesting to me.\nBot: What's one of your favorite movies?\nUser: Apollo 13\nBot: What is it about this type of movie that you like?\nUser: Well Apollo 13's just a really interesting story. It's one of those movies that if it was made and you didn't know it was a true story, you wouldn't think it was true, just cuz of how ridiculous it is. But it's really neat cuz I like space travel movies, and it has Tom Hanks, so that's always a plus.\nBot: Do you like movies like The Matrix?\nBot: If so, can you say why you like that type of movie?\nUser: It's an interesting way to look at the world. It kind of I saw it when I was a teenager. It just kind of makes you think more philosophically and look at the world differently.\nBot: What type of movies do you not like?\nUser: Movies I don't like, I guess foreign films. I don't really like foreign films that much.\nBot: is it because the plot is not great?\nUser: No, it's mostly cuz I don't like reading the subtitles during it, and if it's like dubbed with English voice actors, it just doesn't It ruins the immersion and just sounds terrible, so I can never get into them.\nBot: okay. thanks"
  },
  {
    "dataset": "CCPE",
    "conv_id": 452,
    "conv_topic_label": "Other / Uncategorized",
    "n_user_turns": 10,
    "n_scored_user_turns": 10,
    "avg_satisfaction": 2.9,
    "median_satisfaction": 3.0,
    "low_satisfaction_rate": 0.0,
    "snippet": "Bot: what are some movie genres that you like?\nUser: I like action films, drama, mystery.\nBot: Why is that?\nUser: Well, often I want just simple entertainment, but then sometimes if it's a drama, I like intelligent dialog, serious situations, that sort of thing.\nBot: What is one of your favorite movies?\nUser: The Man for All Seasons. Now that indeed was a serious drama, and I like the intelligent dialog in it.\nBot: aside from the dialogue, what else did you like about it?\nUser: Well overall, it was well acted. The action was very believable. You got to understand the characters' motivation, so it was a very compelling story.\nBot: What type of movies do you not like?\nUser: I I don't like horror films, although I do like Vincent Price, so occasionally I would watch one of those, but normally I don't like horror films. I also usually don't like animation, and actually, even though I like comedy, I don't like probably most comedy films.\nBot: why don't you like most comedy films?\nUser: I I feel they're too simple. They're sort of geared toward the lowest element, as far as the situation and dialog goes, so they lack the sophistication\nUser: The old classic comedies had more meaningful situations than today.\nBot: what did you think of the movie Pulp Fiction?"
  },
  {
    "dataset": "CCPE",
    "conv_id": 284,
    "conv_topic_label": "Topic 2: MISSING_CONTEXT / TONE_ISSUE",
    "n_user_turns": 21,
    "n_scored_user_turns": 21,
    "avg_satisfaction": 2.888888888888889,
    "median_satisfaction": 3.0,
    "low_satisfaction_rate": 0.19047619047619047,
    "snippet": "Bot: What kind of movies do you like?\nUser: I love romantic comedies. I love drama movies. I like suspense movies.\nBot: what do you like about these kind of movies?\nUser: Well, I I usually like the acting, like how sophisticated the acting is. I like to, you know, I like the scenarios, the the plots. I enjoy the scenery in the movie, and the costumes.\nBot: nice, so a good movie production catches your attention.\nUser: Yes, it does.\nBot: is there any particular movie that you've liked a lot?\nUser: Nothing in particular. I mean you know one of my favorite movies is Shawshank Redemption of all time.\nBot: very nice, what do you like about this movie?\nUser: I just loved the the acting, how realistic it was, how suspenseful it was. It was really a very well done movie.\nBot: how about the kind of movies that you don't like, can you tell me about it?\nUser: I don't like movies that have terrible acting, that just don't keep my attention, that are boring, that\nUser: that just not not have any comedy or anything in them.\nBot: so you don't like movies that are too serious?"
  },
  {
    "dataset": "CCPE",
    "conv_id": 234,
    "conv_topic_label": "Topic 1: MISSING_CONTEXT / TONE_ISSUE",
    "n_user_turns": 12,
    "n_scored_user_turns": 12,
    "avg_satisfaction": 2.875,
    "median_satisfaction": 2.875,
    "low_satisfaction_rate": 0.08333333333333333,
    "snippet": "Bot: What type of movies do you enjoy?\nUser: I like dramas and thrillers.\nBot: What appeals to you with these type of movies?\nUser: They're just They usually have interesting stories and they keep you guessing as to what's going to happen. It's They're usually not very boring. So, you're never finding yourself like falling asleep or thinking about other stuff during the movie. You're constantly engaged with it.\nBot: Is there a specific movie you enjoy from this genre?\nUser: Reservoir Dogs is kind of a drama/thriller, so I would consider that one.\nBot: What did you like about this movie?\nUser: The story's just really well told, and it's interesting, like it And it's told in a unique way, where it's kind of flashbacks and flash forwards and just Overall, the story's really neat, cuz bank heists are cool, but it's more It's about a bank heist like after it. You don't even see the bank heist, so it's just a neat way to tell the story.\nBot: Are there any type of movies that you don't enjoy?\nUser: I'm not a big fan of action movies.\nBot: What about these movies is unappealing?\nUser: They're just kind of boring and mindless. I mean, I like them every once in a while, but they all just make you feel like an hour and a half of just the same thing over and over of action scenes and things blowing up which is cool for a while, but they get boring pretty fast.\nBot: Is there a specific movie that you heavily dislike?\nUser: Not an action movie, but I didn't like Twilight movies. Which I only saw two of them, but I doubt the other ones are any better."
  },
  {
    "dataset": "CCPE",
    "conv_id": 190,
    "conv_topic_label": "Topic 5: MISSING_CONTEXT / TONE_ISSUE",
    "n_user_turns": 9,
    "n_scored_user_turns": 9,
    "avg_satisfaction": 2.851851851851852,
    "median_satisfaction": 3.0,
    "low_satisfaction_rate": 0.2222222222222222,
    "snippet": "Bot: What type of movies do you enjoy?\nBot: What appeals to you with these type of movies?\nUser: Gives me the life to keep living and like just every story is the same not the same and to live and experience a new like a person's story.\nBot: Is there a specific movie you enjoy from this genre?\nUser: Yeah, I love The Wild. It's a new film. Into the Wild. The authentic relationship between father and daughter, and then or father and son, and then father and wife.\nBot: What did you like about this movie?\nBot: Are there any type of movies that you don't enjoy?\nUser: I don't like\nUser: romantic comedies\nBot: Is there a specific movie that you heavily dislike?\nBot: What do you dislike about this movie?\nUser: It's just silly.\nBot: Have you seen Titanic\nUser: Yes."
  },
  {
    "dataset": "CCPE",
    "conv_id": 272,
    "conv_topic_label": "Topic 2: MISSING_CONTEXT / TONE_ISSUE",
    "n_user_turns": 16,
    "n_scored_user_turns": 16,
    "avg_satisfaction": 2.85,
    "median_satisfaction": 2.8,
    "low_satisfaction_rate": 0.3125,
    "snippet": "Bot: what kind of movies do you like\nUser: I like sci-fi movies. And I like superhero movies and the occasional comedy.\nBot: what do you like about them\nUser: Usually stars the actresses that I like or actresses that I like, I'm just a bigger nerd. So Sci-Fi is a is a great genre for me, and I like a occasional comedy something like from Adam Sandler or some other comedian.\nBot: adam sandler, ok which movie you like with him in it\nUser: My favorite Adam Sandler movie is The Waterboy. And I don't like his newer stuff, but definitely his older stuff from the mid 2000s is is is all good.\nBot: the waterboy, any particular scene you remember\nUser: Yes, any scene with Rob Schneider in it in The Waterboy. I just love it.\nBot: ok so what is the differences between adam's newer movies to his older ones\nUser: His newer movies lack the comedic output as his older ones. His older ones have almost all original ideas, and his newer ones are seems like it's more made for, you know, like a family environment, like a family comedy rather than, you know, adult comedy. Or just stupid stupid comedy, so\nBot: ah ok, so its more family oriented now, do you think he lost his touch?\nUser: Well, he's still funny. He's just not as funny as he used to be. So, he might have lost a little bit of it, but still he's movies is still entertaining, but just not as much as so.\nBot: gotcha, so he is still a good comedian ,what about other movies you enjoy\nBot: thats not funny"
  },
  {
    "dataset": "SGD",
    "conv_id": 864,
    "conv_topic_label": "Topic 4: UNSUPPORTED_INTENT / MISSING_CONTEXT",
    "n_user_turns": 13,
    "n_scored_user_turns": 13,
    "avg_satisfaction": 2.8461538461538463,
    "median_satisfaction": 2.6666666666666665,
    "low_satisfaction_rate": 0.38461538461538464,
    "snippet": "User: I want to make a restaurant reservation please!\nBot: What time is it for? Do you have a restaurant you'd like to go to?\nUser: Yes I want to go to Lisa's and make it for 17:30.\nBot: Which city should I look in?\nUser: I want to go to Napa. Change my mind and want to eat at the restaurant called Pasta Prego. Make it for March 6th.\nBot: Please confirm the following details: Booking a table for 2 at Pasta Prego, March 6th, at 5:30 pm in Napa.\nUser: Yes that works for me.\nBot: Your reservation went through!\nUser: I want to see a movie nearby.\nBot: What do think of After, Captain Marvel, or Hellboy?\nUser: Those don't appeal to me.\nBot: Would you like to see Little?\nUser: Little is good.\nBot: Do you want tickets?"
  }
]